<a href="https://colab.research.google.com/github/water-beetle/Python_flearning/blob/master/%2313%20%EB%8D%B0%EC%9D%B4%ED%84%B0_%EA%B7%B8%EB%A3%B9%ED%99%94_%ED%95%A8%EC%88%98.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one -0.288220  1.349660
1    a  two -0.281792 -0.152517
2    b  one -0.357388 -0.651407
3    b  two  0.258968 -0.125317
4    a  one  0.398282 -0.611153

**split - apply - combine**

In [0]:
#data1을 key1열의 기준으로 그룹화
grouped = df["data1"].groupby(df["key1"])

In [6]:
grouped

In [8]:
grouped.mean()

key1
a   -0.057243
b   -0.049210
Name: data1, dtype: float64

*Series에서 데이터 그룹화*

In [0]:
means = df["data1"].groupby([df["key1"], df["key2"]]).mean()

In [14]:
means

key1  key2
a     one     0.055031
      two    -0.281792
b     one    -0.357388
      two     0.258968
Name: data1, dtype: float64

In [15]:
means.unstack()

key2       one       two
key1
a     0.055031 -0.281792
b    -0.357388  0.258968

*DataFrame에서 데이터 그룹화*

In [16]:
df.groupby("key1").mean()

         data1     data2
key1
a    -0.057243  0.195330
b    -0.049210 -0.388362

In [18]:
df.groupby("key1").count()

      key2  data1  data2
key1
a        3      3      3
b        2      2      2

In [19]:
  df.groupby(["key1", "key2"]).mean()

              data1     data2
key1 key2
a    one   0.055031  0.369253
     two  -0.281792 -0.152517
b    one  -0.357388 -0.651407
     two   0.258968 -0.125317

In [20]:
df.groupby(["key1", "key2"]).count()

           data1  data2
key1 key2
a    one       2      2
     two       1      1
b    one       1      1
     two       1      1

In [22]:
# 특정 열의 통계량을 계산한 값 추출
df.groupby(["key1", "key2"])["data2"].mean()

key1  key2
a     one     0.369253
      two    -0.152517
b     one    -0.651407
      two    -0.125317
Name: data2, dtype: float64

**그룹화를 수행한 직후의 결과물 확인**

In [24]:
#g확인 불가능
df.groupby("key1")

In [25]:
for name, group in df.groupby("key1"):
  print(name)
  print(group)

a
  key1 key2     data1     data2
0    a  one -0.288220  1.349660
1    a  two -0.281792 -0.152517
4    a  one  0.398282 -0.611153
b
  key1 key2     data1     data2
2    b  one -0.357388 -0.651407
3    b  two  0.258968 -0.125317

In [27]:
for (k1, k2), group in df.groupby(["key1", "key2"]):
  print(k1, k2)
  print(group)

a one
  key1 key2     data1     data2
0    a  one -0.288220  1.349660
4    a  one  0.398282 -0.611153
a two
  key1 key2     data1     data2
1    a  two -0.281792 -0.152517
b one
  key1 key2     data1     data2
2    b  one -0.357388 -0.651407
b two
  key1 key2     data1     data2
3    b  two  0.258968 -0.125317

In [0]:
pieces = dict(list(df.groupby("key1")))

In [29]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one -0.288220  1.349660
 1    a  two -0.281792 -0.152517
 4    a  one  0.398282 -0.611153, 'b':   key1 key2     data1     data2
 2    b  one -0.357388 -0.651407
 3    b  two  0.258968 -0.125317}

In [30]:
pieces["b"]

  key1 key2     data1     data2
2    b  one -0.357388 -0.651407
3    b  two  0.258968 -0.125317

In [0]:
df2 = pd.DataFrame(np.random.randn(5, 5), 
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
map_dict = {'a': 'red', 'b': 'red', 'c': 'blue', 
            'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [32]:
df2

               a         b         c         d         e
Joe     0.256892  0.041847  0.824133  0.529979 -1.304827
Steve  -0.529186 -0.349971  0.694507 -1.266733  1.157681
Wes    -0.278038  0.046071  0.160499 -0.333776 -1.257408
Jim     1.569861 -1.433560  1.022749 -0.470855  0.361642
Travis -0.117486 -0.303615  0.767326  0.182665  0.606682

In [33]:
map_dict

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [34]:
df2.groupby(map_dict, axis=1).sum()

            blue       red
Joe     1.354112 -1.006089
Steve  -0.572227  0.278524
Wes    -0.173277 -1.489375
Jim     0.551894  0.497943
Travis  0.949991  0.185582

In [0]:
map_s = pd.Series(map_dict)

In [37]:
df2.groupby(map_s, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        2    3
Jim        2    3
Travis     2    3

In [38]:
df

  key1 key2     data1     data2
0    a  one -0.288220  1.349660
1    a  two -0.281792 -0.152517
2    b  one -0.357388 -0.651407
3    b  two  0.258968 -0.125317
4    a  one  0.398282 -0.611153

In [0]:
grouped = df.groupby("key1")

In [0]:
def peak_to_peak(arr):
  return arr.max() - arr.min()

agg를 이용해 함수 적용

In [42]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.686502  1.960812
b     0.616357  0.526090

In [44]:
#표준편차
grouped.agg("std")

        data1     data2
key1
a     0.39451  1.025644
b     0.43583  0.372002

In [46]:
grouped.describe()

     data1                               ...     data2
     count      mean      std       min  ...       25%       50%       75%       max
key1                                     ...
a      3.0 -0.057243  0.39451 -0.288220  ... -0.381835 -0.152517  0.598571  1.349660
b      2.0 -0.049210  0.43583 -0.357388  ... -0.519884 -0.388362 -0.256839 -0.125317

[2 rows x 16 columns]